Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_17 (Conv2D)           (None, 64, 64, 256)       7168      
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 64, 64, 128)       295040    
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 32, 32, 128)       0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 32, 32, 128)       147584    
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 32, 32, 64)        73792     
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 16, 16, 64)        0         
_________________________________________________________________
dropout_12 (Dropout)         (None, 16, 16, 64)        0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 16384)             0         
_________________________________________________________________
dense_13 (Dense)             (None, 128)               2097280   
_________________________________________________________________
dropout_13 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_14 (Dense)             (None, 62)                7998      
=================================================================
Total params: 2,628,862
Trainable params: 2,628,862
Non-trainable params: 0