Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_37 (Conv2D)           (None, 64, 64, 96)        34944     
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 31, 31, 96)        0         
_________________________________________________________________
conv2d_38 (Conv2D)           (None, 31, 31, 256)       614656    
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 15, 15, 256)       0         
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 15, 15, 384)       885120    
_________________________________________________________________
conv2d_40 (Conv2D)           (None, 15, 15, 384)       1327488   
_________________________________________________________________
conv2d_41 (Conv2D)           (None, 15, 15, 256)       884992    
_________________________________________________________________
max_pooling2d_24 (MaxPooling (None, 7, 7, 256)         0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 12544)             0         
_________________________________________________________________
dropout_12 (Dropout)         (None, 12544)             0         
_________________________________________________________________
dense_19 (Dense)             (None, 4096)              51384320  
_________________________________________________________________
dropout_13 (Dropout)         (None, 4096)              0         
_________________________________________________________________
dense_20 (Dense)             (None, 4096)              16781312  
_________________________________________________________________
dense_21 (Dense)             (None, 62)                254014    
=================================================================
Total params: 72,166,846
Trainable params: 72,166,846
Non-trainable params: 0
_________________________________________________________________