Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_10 (Conv2D)           (None, 64, 64, 128)       3584      
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 64, 64, 64)        73792     
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 32, 32, 64)        0         
_________________________________________________________________
dropout_10 (Dropout)         (None, 32, 32, 64)        0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 65536)             0         
_________________________________________________________________
dense_10 (Dense)             (None, 128)               8388736   
_________________________________________________________________
dropout_11 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 62)                7998      
=================================================================
Total params: 8,474,110
Trainable params: 8,474,110
Non-trainable params: 0
_________________________________________________________________